# LatestCentralVersion Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BasicFileInfo..::..LatestCentralVersion Property
BasicFileInfo Class See Also
---
This is the central model's version number corresponding to the last reload latest done for this model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int LatestCentralVersion { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LatestCentralVersion As Integer
	Get
```

Visual C++
---
```text
public:
property int LatestCentralVersion {
	int get ();
}
```

# See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace